KANAIHIROYUKI/STM32/F103_48/main.cpp
#include "stm32f10x.h"
#include "stdio.h"


#include "SYSTEM.h"


#define CAN_ID 0x07FF

uint16_t a;
uint16_t rxFlag = 0;

int16_t enc1=0;

uint8_t canData[8] = {0,0,0,0,0,0,0,0};

CanRxMsg RxMessage;

GPIO led;
GPIO canRx;
GPIO canTx;
GPIO usart1Tx;
GPIO usart1Rx;
GPIO usart2Tx;
GPIO usart2Rx;
GPIO aIn;
GPIO encA;
GPIO encB;

GPIO spiNss;
GPIO spiMosi;
GPIO spiMiso;
GPIO spiSck;

GPIO pwmout;
TIM pwm;
TIM enc;

ADC pot;

USART serial;
//USART serial2;

int main(void)
{
	setup();
	GPIOSetup();

	led.setup(GPIOB,GPIO_Pin_0,GPIO_Mode_Out_PP);

	canTx.setup(GPIOA,GPIO_Pin_12,GPIO_Mode_AF_PP);
	canRx.setup(GPIOA,GPIO_Pin_11,GPIO_Mode_AF_PP);

	usart1Tx.setup(GPIOA,GPIO_Pin_9,GPIO_Mode_AF_PP);
	usart1Rx.setup(GPIOA,GPIO_Pin_10,GPIO_Mode_IN_FLOATING);
	//usart2Tx.setup(GPIOA,GPIO_Pin_2,GPIO_Mode_AF_PP);
	//usart2Rx.setup(GPIOA,GPIO_Pin_3,GPIO_Mode_IN_FLOATING);

	spiNss.setup(GPIOA,GPIO_Pin_4,GPIO_Mode_Out_PP);
	spiSck.setup(GPIOA,GPIO_Pin_5,GPIO_Mode_AF_PP);
	spiMiso.setup(GPIOA,GPIO_Pin_6,GPIO_Mode_AF_PP);
	spiMosi.setup(GPIOA,GPIO_Pin_7,GPIO_Mode_AF_PP);

	encA.setup(GPIOA,GPIO_Pin_0,GPIO_Mode_IPU);
	encB.setup(GPIOA,GPIO_Pin_1,GPIO_Mode_IPU);

	pwmout.setup(GPIOA,GPIO_Pin_6,GPIO_Mode_AF_PP);
	pwm.pwmSetup(TIM3,1);

	aIn.setup(GPIOA,GPIO_Pin_2,GPIO_Mode_AIN);
	pot.setup(ADC1,2);

	//SPI1Setup(SPI_Mode_Master,SPI_Mode0,SPI_BaudRatePrescaler_256);

	serial.setup(USART1,115200);

	//spiNss.write(Bit_SET);

	//SPI_I2S_SendData(SPI1,0b01010101);

	RCC_APB2PeriphClockCmd(RCC_APB2ENR_AFIOEN,ENABLE);

	GPIO_PinRemapConfig(GPIO_Remap1_CAN1,ENABLE);

	serial.printf("DATE = ");
	serial.printf(__DATE__);
	serial.printf("\n\rTIME = ");
	serial.printf(__TIME__);
	serial.printf("\n\r");

	serial.printf("serial.printf");

	serial.printf("\n\rADC1 CH0 read = %d\n\r",pot.read());
	CAN1Setup();

	//エンコーダ
	enc.encoderSetup(TIM2);

	/*
	RCC_APB1PeriphClockCmd(RCC_APB1ENR_TIM2EN,ENABLE);
	TIM_EncoderInterfaceConfig(TIM2,TIM_EncoderMode_TI12,TIM_ICPolarity_Rising,TIM_ICPolarity_Rising);
	TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);
	TIM_Cmd(TIM2,ENABLE);*/

	//入力割込み
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO,ENABLE);
    //GPIO_EXTILineConfig(GPIO_PortSourceGPIOA,GPIO_PinSource14);
    //GPIO_EXTILineConfig(GPIO_PortSourceGPIOA,GPIO_PinSource15);

    /*
    GPIO_EXTILineConfig(GPIO_PortSourceGPIOA,GPIO_PinSource0);

    EXTI_InitTypeDef EXTI_InitStructure;
    EXTI_StructInit(&EXTI_InitStructure);
    EXTI_InitStructure.EXTI_Line = EXTI_Line0;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);

    NVIC_InitTypeDef NVIC_InitStructure;
    NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x03;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x00;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);*/

    while(1){
    	a = pot.read();

    	pwm.duty(a/4);
    	serial.printf("%d,%d,%d\n\r",a,enc.read(),enc.tim2Cnt);
    	/*
    	serial.printf("\n\r");

    	while(serial.available()){
    		printf("rx = %d,read = %d,available = %d",USART::usart1RxAddress,USART::usart1ReadAddress,serial.available());
    		serial.send(serial.read());
    		printf("\n\r");
    		//serial.read();
    	}
    	printf("\n\r write = %d,send = %d\n\r",USART::usart1TxSendAddress,USART::usart1TxWriteAddress);
    	for(int i=0;i<USART_TX_BUFFER_SIZE;i++){
    		printf("%d,\n\r",USART::usart1TxBuffer[i]);
    	}
    	printf("\n\r");
    	*/

    	delay(200);
    	led.write(Bit_SET);

    	delay(200);
    	led.write(Bit_RESET);

    	canData[0] = a/16;
    	serial.printf("CAN tx messase = %d\n\r",canData[0]);
    	CAN1Send(CAN_ID,1,canData);
    	while(CANTXOK != CAN_TransmitStatus(CAN1,0));

    	serial.printf("FIFO : %d\n\r",CAN_MessagePending(CAN1,CAN_FIFO0));
    	CAN_GetITStatus(CAN1,CAN_IT_RQCP0);


    	if(rxFlag == 1){
    		rxFlag = 0;
    		serial.printf("CAN Data 0 : %4d ENC : %4d\n\r",RxMessage.Data[0],enc1);
    	}

    	while(CAN_MessagePending(CAN1,CAN_FIFO0) != 0){
    		CAN_Receive(CAN1,CAN_FIFO0,&RxMessage);
    		serial.printf("CAN rx messase = %d\n\r",RxMessage.Data[0]);
    	}
    }
}







extern "C" void USB_LP_CAN1_RX0_IRQHandler(void){
	rxFlag = 1;
	CAN_Receive(CAN1,CAN_FIFO0,&RxMessage);

	return;
}

extern "C" void CAN1_RX1_IRQHandler(void){
	rxFlag = 1;
	CAN_Receive(CAN1,CAN_FIFO0,&RxMessage);
	return;
}

extern "C" void EXTI0_IRQHandler(void){
	EXTI_ClearITPendingBit(EXTI_Line0);
	enc1++;
}

